INSERT INTO dynasty VALUES (NULL, '三国');
INSERT INTO dynasty VALUES (NULL, '隋朝');
INSERT INTO dynasty VALUES (NULL, '唐朝');
INSERT INTO dynasty VALUES (NULL, '宋朝');
INSERT INTO dynasty VALUES (NULL, '元朝');
INSERT INTO dynasty VALUES (NULL, '明朝');
INSERT INTO dynasty VALUES (NULL, '清朝');

INSERT into auther VALUES (NULL,'刘禹锡',3,'772年-842年','刘禹锡（772年~842年），字梦得，籍贯河南洛阳，生于河南郑州荥阳，自述“家本荥上，籍占洛阳” ，其先祖为中山靖王刘胜 [1-2]   （一说是匈奴后裔） [3]  。唐朝时期大臣、文学家、哲学家，有“诗豪”之称。
刘禹锡于贞元九年（793年）进士及第，初任太子校书，迁淮南记室参军，后入节度使杜佑幕府，深得杜佑的信任与器重。杜佑入朝为相，刘禹锡亦迁监察御史。贞元末年，加入以太子侍读王叔文为首的“二王八司马”政治集团。唐顺宗即位后，刘禹锡参与“永贞革新”。革新失败后，屡遭贬谪。会昌二年（842年），迁太子宾客，卒于洛阳，享年七十一，追赠户部尚书，葬于荥阳。 [4] 
刘禹锡诗文俱佳，涉猎题材广泛，与柳宗元并称“刘柳”，与韦应物、白居易合称“三杰”，并与白居易合称“刘白”，留下《陋室铭》《竹枝词》《杨柳枝词》《乌衣巷》等名篇。刘禹锡的哲学著作《天论》三篇，论述天的物质性，分析“天命论”产生的根源，具有唯物主义思想。著有《刘梦得文集》《刘宾客集》。 [5] ');
INSERT into auther VALUES (NULL,'李白',3,'701年-762年','李白有《李太白集》传世，诗作中多以醉时写的，代表作有《望庐山瀑布》《行路难》《蜀道难》《将进酒》《早发白帝城》等多首。 [3]  李白所作词赋，宋人已有传记（如文莹《湘山野录》卷上），就其开创意义及艺术成就而言，“李白词”享有极为崇高的地位。 [25] ');
INSERT into auther VALUES (NULL,'杜甫',3,'712年2月12日-770年','杜甫少年时代曾先后游历吴越和齐赵，其间曾赴洛阳应举不第。三十五岁以后，先在长安应试，落第；后来向皇帝献赋，向贵人投赠。官场不得志，目睹了唐朝上层社会的奢靡与社会危机。天宝十四载（755年），安史之乱爆发，潼关失守，杜甫先后辗转多地。乾元二年（759年）杜甫弃官入川，虽然躲避了战乱，生活相对安定，但仍然心系苍生，胸怀国事。杜甫创作了《登高》《春望》《北征》以及“三吏”、“三别”等名作。虽然杜甫是个现实主义诗人，但他也有狂放不羁的一面，从其名作《饮中八仙歌》不难看出杜甫的豪气干云。');
INSERT into auther VALUES (NULL,'龚自珍',7,'1792年8月22日－1841年9月26日','字璱人，号定盦（一作定庵）。汉族，浙江仁和（今杭州）人。晚年居住昆山羽琌山馆，又号羽琌山民。清代思想家、诗人、文学家和改良主义的先驱者。龚自珍曾任内阁中书、宗人府主事和礼部主事等官职。主张革除弊政，抵制外国侵略，曾全力支持林则徐禁除鸦片。48岁辞官南归，次年卒于江苏丹阳云阳书院。他的诗文主张“更法”、“改图”，揭露清统治者的腐朽，洋溢着爱国热情，被柳亚子誉为“三百年来第一流”。著有《定盦文集》，留存文章300余篇，诗词近800首，今人辑为《龚自珍全集》。著名诗作《己亥杂诗》共315首。多咏怀和讽喻之作。');
INSERT into poetry VALUES (Null,1,'酬乐天扬州初逢席上见赠','<p>巴山楚水凄凉地，二十三年弃置身。</p>
       <p>怀旧空吟闻笛赋，到乡翻似烂柯人。</p>
       <P>沉舟侧畔千帆过，病树前头万木春。</P>
       <p>今日听君歌一曲，暂凭杯酒长精神。</p>','<p>在巴山楚水这些凄凉的地方，度过了二十三年沦落的光阴。</p>
<p>怀念故友徒然吟诵闻笛小赋，久谪归来感到已非旧时光景。</p>
<p>沉船的旁边正有千艘船驶过，病树的前头却也是万木争春。</p>
<p>今天听了你为我吟诵的诗篇，暂且借这一杯美酒振奋精神。</p>','整体赏析
《酬乐天扬州初逢席上见赠》是显示自己对世事变迁和仕宦升沉的豁达襟怀，表现了诗人的坚定信念和乐观精神，同时又暗含哲理，表明新事物必将取代旧事物。
刘禹锡这首酬答诗，接过白居易诗的话头，着重抒写这特定环境中自己的感情。白的赠诗中，白居易对刘禹锡的遭遇无限感慨，最后两句说：“亦知合被才名折，二十三年折太多。”一方面感叹刘禹锡的不幸命运，另一方面又称赞了刘禹锡的才气与名望。这两句诗，在同情之中又包含着赞美，显得十分委婉。因为白居易在诗的末尾说到二十三年，所以刘禹锡在诗的开头就接着说：“巴山楚水凄凉地，二十三年弃置身。”自己谪居在巴山楚水这荒凉的地区，算来已经二十三年了。一来一往，显出朋友之间推心置腹的亲切关系。接着，诗人很自然地发出感慨道：“怀旧空吟闻笛赋，到乡翻似烂柯人。”说自己在外二十三年，如今回来，许多老朋友都已去世，只能徒然地吟诵“闻笛赋”表示悼念而已。此番回来恍如隔世，觉得人事全非，不再是旧日的光景了。后一句用王质烂柯的典故，既暗示了自己贬谪时间的长久，又表现了世态的变迁，以及回归之后生疏而怅惘的心情，涵义十分丰富。','酬：答谢，酬答，这里是指以诗相答的意思。用诗歌赠答。乐天：指白居易，字乐天。见赠：送给（我）。
巴山楚水：指四川、湖南、湖北一带。古时四川东部属于巴国，湖南北部和湖北等地属于楚国。刘禹锡被贬后，迁徙于朗州、连州、夔州、和州等边远地
区，这里用“巴山楚水”泛指这些地方。
二十三年：从唐顺宗永贞元年（805）刘禹锡被贬为连州刺史，至宝历二年（826）冬应召，约二十二年。因贬地离京遥远，实际上到第二年才能回到京城，所以说二十三年。弃置身：指遭受贬谪的诗人自己。置：放置。弃置：贬谪。
怀旧：怀念故友。吟：吟唱。闻笛赋：指西晋向秀的《思旧赋》。三国曹魏末年，向秀的朋友嵇康 、吕安因不满司马氏篡权而被杀害。后来，向秀经过嵇康、吕安的旧居，听到邻人吹笛，不禁悲从中来，于是作《思旧赋》。 序文中说：自己经过嵇康旧居，因写此赋追念他。刘禹锡借用这个典故怀念已死去的王叔文、柳宗元等人。
到：到达。翻似：倒好像。翻：副词，反而。烂柯人：指晋人王质。相传晋人王质上山砍柴，看见两个童子下棋，就停下观看。等棋局终了，手中的斧柄（柯）已经朽烂。回到村里，才知道已过了一百年。同代人都已经亡故。作者以此典故表达自己遭贬二十三年的感慨。刘禹锡也借这个故事表达世事沧桑，人事全非，暮年返乡恍如隔世的心情。
侧畔：旁边。
沉舟、病树：这是诗人以沉舟、病树自比。
歌一曲：指白居易的《醉赠刘二十八使君》。
长（zhǎng）精神：振作精神。长：增长，振作。','沉舟侧畔千帆过 病树前头万木春',372,1);

INSERT into poetry VALUES (Null,2,'蜀道难','<p>噫吁嚱2，危乎高哉！蜀道之难，难于上青天！</P>
<p>蚕丛及鱼凫3，开国何茫然4！</P>
<p>尔来四万八千岁5，不与秦塞通人烟6。</P>
<p>西当太白有鸟道7，可以横绝峨眉巅8。</P>
<p>地崩山摧壮士死9，然后天梯石栈相钩连10。</P>
<p>上有六龙回日之高标11，下有冲波逆折之回川12。</P>
<p>黄鹤之飞尚不得过13，猿猱欲度愁攀援14。</P>
<p>青泥何盘盘15，百步九折萦岩峦16。</P>
<p>扪参历井仰胁息17，以手抚膺坐长叹18。</P>
<p>问君西游何时还19？畏途巉岩不可攀20。</P>
<p>但见悲鸟号古木21，雄飞雌从绕林间22。</P>
<p>又闻子规啼夜月，愁空山23。</P>
<p>蜀道之难，难于上青天，使人听此凋朱颜24。</P>
<p>连峰去天不盈尺25，枯松倒挂倚绝壁。</P>
<p>飞湍瀑流争喧豗26，砯崖转石万壑雷27。</P>
<p>其险也如此28，嗟尔远道之人胡为乎来哉29！</P>
<p>剑阁峥嵘而崔嵬30，一夫当关，万夫莫开31。</P>
<p>所守或匪亲32，化为狼与豺。</P>
<p>朝避猛虎33，夕避长蛇。</P>
<p>磨牙吮血34，杀人如麻。</P>
<p>锦城虽云乐35，不如早还家。</P>
<p>蜀道之难，难于上青天，侧身西望长咨嗟36！</P>','唉呀呀，多么高峻多么伟岸！蜀道真太难攀简直难于上青天。
传说中蚕丛和鱼凫建立了蜀国，开国的年代实在久远无法详谈。自从那时至今约有四万八千年，秦蜀被秦岭所阻从不沟通往返。西边太白山有飞鸟能过的小道。从那小路走可横渡峨嵋山顶端。山崩地裂蜀国五壮士被压死了，两地才有天梯栈道开始相通连。
上有挡住太阳神六龙车的山巅，下有激浪排空纡回曲折的大川。善于高飞的黄鹤尚且无法飞过，即使猢狲要想翻过也愁于攀援。青泥岭多么曲折绕着山峦盘旋，百步之内萦绕岩峦转九个弯弯。可以摸到参井星叫人仰首屏息，用手抚胸惊恐不已徒劳地长叹。
好朋友呵请问你西游何时回还？可怕的岩山栈道实在难以登攀！只见那悲鸟在古树上哀鸣啼叫，雄雌相随飞翔在原始森林之间。月夜听到的是杜鹃悲惨的啼声，令人愁思绵绵呵这荒荡的空山！蜀道真难走呵简直难于上青天，叫人听到这些怎么不脸色突变？
山峰座座相连离天还不到一尺；枯松老枝倒挂倚贴在绝壁之间。漩涡飞转瀑布飞泻争相喧闹着；水石相击转动像万壑鸣雷一般。那去处恶劣艰险到了这种地步；唉呀呀你这个远方而来的客人，为了什么要来到这个险要地方？
剑阁那地方崇峻巍峨高入云端，只要一人把守千军万马难攻占。驻守的官员若不是皇家的近亲；难免要变为豺狼踞此为非造反。
清晨你要提心吊胆地躲避猛虎，傍晚你要警觉防范长蛇的灾难。豺狼虎豹磨牙吮血真叫人不安，毒蛇猛兽杀人如麻即令你胆寒。锦官城虽然说是个快乐的所在，如此险恶还不如早早地把家还。蜀道太难走呵简直难于上青天，侧身西望令人不免感慨与长叹！','《蜀道难》是李白的代表作。诗人袭用乐府古题，展开丰富的想象，着力描绘了秦蜀道路上奇丽惊险的山川，并从中透露了对社会的某些忧虑与关切。诗人大体按照由古及今，自秦入蜀的线索，抓住各处山水特点来描写，以展示蜀道之难。从“噫吁嚱”到“然后天梯石栈相钩连”为一个段落。一开篇就极言蜀道之难，以感情强烈的咏叹点出主题，为全诗奠定了雄放的基调。以下随着感情的起伏和自然场景的变化，“蜀道之难，难于上青天”的咏叹反复出现，像一首乐曲的主旋律一样激荡着读者的心弦。
说蜀道的难行比上天还难，这是因为自古以来秦、蜀之间被高山峻岭阻挡，由秦入蜀，太白峰首当其冲，只有高飞的鸟儿能从低缺处飞过。太白峰在秦都咸阳西南，是关中一带的最高峰。民谚云：“武公太白，去天三百。”诗人以夸张的笔墨写出了历史上不可逾越的险阻，并融汇了五丁开山的神话，点染了神奇色彩，犹如一部乐章的前奏，具有引人入胜的妙用。下面即着力刻画蜀道的高危难行了。
从“上有六龙回日之高标”至“使人听此凋朱颜”为又一段落。这一段极写山势的高危，山高写得愈充分，愈可见路之难行。你看那突兀而立的高山，高标接天，挡住了太阳神的运行；山下则是冲波激浪、曲折回旋的河川。诗人不但把夸张和神话融为一体，直写山高，而且衬以“回川”之险。唯其水险，更见山势的高危。诗人意犹未足，又借黄鹤与猿猱来反衬。山高得连千里翱翔的黄鹤也不得飞度，轻疾敏捷的猿猴也愁于攀援，不言而喻，人行走就难上加难了。以上用虚写手法层层映衬，下面再具体描写青泥岭的难行。
青泥岭，“悬崖万仞，山多云雨”（《元和郡县志》），为唐代入蜀要道。诗人着重就其峰路的萦回和山势的峻危来表现人行其上的艰难情状和畏惧心理，捕捉了在岭上曲折盘桓、手扪星辰、呼吸紧张、抚胸长叹等细节动作加以摹写，寥寥数语，便把行人艰难的步履、惶悚的神情，绘声绘色地刻画出来，困危之状如在目前。
至此蜀道的难行似乎写到了极处。但诗人笔锋一转，借“问君”引出旅愁，以忧切低昂的旋律，把读者带进一个古木荒凉、鸟声悲凄的境界。杜鹃鸟空谷传响，充满哀愁，使人闻声失色，更觉蜀道之难。诗人借景抒情，用“悲鸟号古木”、“子规啼夜月”等感情色彩浓厚的自然景观，渲染了旅愁和蜀道上空寂苍凉的环境气氛，有力地烘托了蜀道之难。
然而，逶迤千里的蜀道，还有更为奇险的风光。自“连峰去天不盈尺”至全篇结束，主要从山川之险来揭示蜀道之难，着力渲染惊险的气氛。如果说“连峰去天不盈尺”是夸饰山峰之高，“枯松倒挂倚绝壁”则是衬托绝壁之险。
诗人先托出山势的高险，然后由静而动，写出水石激荡、山谷轰鸣的惊险场景。好像一串电影镜头：开始是山峦起伏、连峰接天的远景画面；接着平缓地推成枯松倒挂绝壁的特写；而后，跟踪而来的是一组快镜头，飞湍、瀑流、悬崖、转石，配合着万壑雷鸣的音响，飞快地从眼前闪过，惊险万状，目不暇接，从而造成一种势若排山倒海的强烈艺术效果，使蜀道之难的描写，简直达到了登峰造极的地步。如果说上面山势的高危已使人望而生畏，那此处山川的险要更令人惊心动魄了。
风光变幻，险象丛生。在十分惊险的气氛中，最后写到蜀中要塞剑阁，在大剑山和小剑山之间有一条三十里长的栈道，群峰如剑，连山耸立，削壁中断如门，形成天然要塞。因其地势险要，易守难攻，历史上在此割据称王者不乏其人。诗人从剑阁的险要引出对政治形势的描写。他化用西晋张载《剑阁铭》中“形胜之地，匪亲勿居”的语句，劝人引为鉴戒，警惕战乱的发生，并联系当时的社会背景，揭露了蜀中豺狼的“磨牙吮血，杀人如麻”，从而表达了对国事的忧虑与关切。唐天宝初年，太平景象的背后正潜伏着危机，后来发生的安史之乱，证明诗人的忧虑是有现实意义的。
李白以变化莫测的笔法，淋漓尽致地刻画了蜀道之难，艺术地展现了古老蜀道逶迤、峥嵘、高峻、崎岖的面貌，描绘出一幅色彩绚丽的山水画卷。诗中那些动人的景象宛如历历在目。
李白之所以描绘得如此动人，还在于融贯其间的浪漫主义激情。诗人寄情山水，放浪形骸。他对自然景物不是冷漠的观赏，而是热情地赞叹，借以抒发自己的理想感受。那飞流惊湍、奇峰险壑，赋予了诗人的情感气质，因而才呈现出飞动的灵魂和瑰伟的姿态。诗人善于把想象、夸张和神话传说融为一体进行写景抒情。言山之高峻，则曰“上有六龙回日之高标”；状道之险阻，则曰“地崩山摧壮士死，然后天梯石栈相钩连”。诗人“驰走风云，鞭挞海岳”（陆时雍《诗镜总论》评李白七古语），从蚕丛开国说到五丁开山，由六龙回日写到子规夜啼，天马行空般地驰骋想象，创造出博大浩渺的艺术境界，充满了浪漫主义色彩。透过奇丽峭拔的山川景物，仿佛可以看到诗人那“落笔摇五岳、笑傲凌沧洲”的高大形象。
唐以前的《蜀道难》作品，简短单薄。李白对东府古题有所创新和发展，用了大量散文化诗句，字数从三言、四言、五言、七言，直到十一言，参差错落，长短不齐，形成极为奔放的语言风格。诗的用韵，也突破了梁陈时代旧作一韵到底的程式。后面描写蜀中险要环境，一连三换韵脚，极尽变化之能事。
关于此篇，前人有种种寓意之说，断定是专为某人某事而作的。明人胡震亨、顾炎武认为，李白“自为蜀咏”，“别无寓意”。今人有谓此诗表面写蜀道艰险，实则写仕途坎坷，反映了诗人在长期漫游中屡逢踬碍的生活经历和怀才不遇的愤懑，迄无定论。','1.蜀道难：南朝乐府旧题，属《相和歌·瑟调曲》。
2.噫（yī）吁（xū）嚱（xī）：惊叹声，蜀地方言，表示惊讶的声音。宋庠《宋景文公笔记》卷上：“蜀人见物惊异，辄曰‘噫吁嚱’。”
3.蚕丛及鱼凫（fú）：蚕丛、鱼凫，传说中古蜀国两位国王的名字。
4.何茫然：指古史传说悠远难详，不知道。何，多么。茫然，渺茫，完全不知道的样子。据西汉扬雄《蜀本王纪》记载：“蜀王之先，名蚕丛、柏灌、鱼凫，蒲泽、开明。……从开明上至蚕丛，积三万四千岁。”
5.尔来：从那时以来。四万八千岁：极言时间之漫长，夸张而大约言之。
6.秦塞（sài）：秦的关塞，指秦地。秦地四周有山川险阻，故称“四塞之地”。通人烟：人员往来。
7.西当：西对。当，在；一说对着，向着。太白：秦岭峰名，又名太乙山，在长安西（今陕西眉县、太白县一带）。鸟道：指连绵高山间的低缺处，只有鸟能飞过，人迹所不能至。
8.横绝：横越。峨眉：山名，在今四川省峨眉山市西南。巅，顶峰，一作“颠”。
9.“地崩”句：《华阳国志·蜀志》：相传秦惠王想征服蜀国，知道蜀王好色，答应送给他五个美女。蜀王派五位壮士去接人。回到梓潼（今四川剑阁之南）的时候，看见一条大蛇进入穴中，一位壮士抓住了它的尾巴，其余四人也来相助，用力往外拽。不多时，山崩地裂，壮士和美女都被压死。山分为五岭，入蜀之路遂通。这便是有名的“五丁开山”的故事。摧：倒塌。
10.天梯：非常陡峭的山路。石栈（zhàn）：栈道。相：一作“方”。
11.六龙回日之高标：一作“横河断海之浮云”。六龙回日，《淮南子》注云：“日乘车，驾以六龙。羲和御之。日至此面而薄于虞渊，羲和至此而回六螭。”意思就是传说中的羲和驾驶着六龙之车（即太阳）到此处便迫近虞渊（传说中的日落处）。高标，指蜀山中可作一方之标识的最高峰。标，标尺，标志。
12.冲波：水流冲击腾起的波浪，这里指激流。逆折：水流回旋。回川：有漩涡的河流。
13.黄鹤：即黄鹄（hú），善飞的大鸟。尚：尚且。得：能。
14.猿猱（náo）：蜀山中最善攀援的猴类。援：一作“缘”。
15.青泥：青泥岭，在今甘肃徽县南，陕西略阳县北。《元和郡县志》卷二十二：“青泥岭，在县西北五十三里，接溪山东，即今通路也。悬崖万仞，山多云雨，行者屡逢泥淖，故号青泥岭。”盘盘：曲折回旋的样子。
16.百步九折：百步之内拐九道弯。萦（yíng）：盘绕。岩峦：山峰。
17.扪（mén）：用手摸。历：经过。参（shēn）、井：都是古代天文学上的星宿名。古人把天上的星宿分别指配于地上的州国，叫做“分野”，以便通过观察天象来占卜地上所配州国的吉凶。参星为蜀之分野，井星为秦之分野。胁息：屏气不敢呼吸。
18.膺（yīng）：胸。坐：徒，空。
19.问君：一作“征人”。君，入蜀的友人。时：一作“当”。
20.畏途：可怕的路途。巉（chán）岩：险恶陡峭的山壁。
21.但见：只听见。号（háo）古木：在古树木中大声啼鸣。古，一作“枯”。
22.从：跟随。
23.“又闻”二句：一本断为“又闻子规啼，夜月愁空山”。子规，即杜鹃鸟，蜀地最多，鸣声悲哀，若云“不如归去”。《蜀记》曰：“昔有人姓杜名宇，王蜀，号曰望帝。宇死，俗说杜宇化为子规。子规，鸟名也。蜀人闻子规鸣，皆曰望帝也。”
24.凋朱颜：红颜带忧色，如花凋谢。凋，使动用法，使……凋谢，这里指脸色由红润变成铁青。
25.去天不盈尺：一作“入烟几千尺”。去，距离。盈，满。
26.飞湍（tuān）：飞奔而下的急流。喧豗（huī）：喧闹声，这里指急流和瀑布发出的巨大响声。
27.砯（pīng）崖：水撞石之声。砯，水冲击石壁发出的响声，这里作动词用，冲击的意思。转：使滚动。壑（hè）：山谷。
28.如此：一作“若此”。
29.嗟（jiē）：感叹声。尔：你。胡为：为什么。来：指入蜀。
30.剑阁：又名剑门关，在四川剑阁县北，是大、小剑山之间的一条栈道，长约三十余里。峥嵘、崔嵬（wéi）：都是形容山势高大雄峻的样子。
31.“一夫”两句：《文选》卷四左思《蜀都赋》：“一人守隘，万夫莫向”。《文选》卷五十六张载《剑阁铭》：“一人荷戟，万夫趦趄。形胜之地，匪亲勿居。”一夫，一人。当关，守关。万夫，一作“万人”。莫开，不能打开。
32.所守：指把守关口的人。或匪（fěi）亲：倘若不是可信赖的人。或，倘若。匪，同“非”。亲，一作“人”。
33.朝（zhāo）：早上。
34.吮（shǔn）血（xuè）：吸血。
35.锦城：锦官城，即今四川省成都市。成都古代以产锦闻名，朝廷曾经设官于此，专收锦织品，故称锦城或锦官城。《元和郡县志》卷三十一剑南道成都府成都县：“锦城在县南十里，故锦官城也。”
36.长咨（zī）嗟：一作“令人嗟”。咨嗟，叹息。','蜀道之难 难于上青天',0,0);

INSERT into poetry VALUES (NULL,3,'登高','<p>风急天高猿啸哀⑵， 渚清沙白鸟飞回⑶。</p>
<p>无边落木萧萧下⑷， 不尽长江滚滚来。</p>
<p>万里悲秋常作客⑸，百年多病独登台⑹。</p>
<p>艰难苦恨繁霜鬓⑺， 潦倒新停浊酒杯⑻</p>','<p>秋风急秋气高猿声凄哀，洲渚青沙滩白鸟儿回旋。</p>
<p>落叶一望无际萧萧堕下，长江不见尽头滚滚涌来。</p>
<p>万里悲秋感慨长期漂泊，一生多病独自登上高台。</p>
<p>深为憾恨鬓发日益斑白，困顿潦倒病后停酒伤怀。</p>','《登高》可能是《九日五首》中的一首，只因写得格外成功，远胜其余四首，故尔为编诗者独立出来。此诗通过登高所见秋江景色，倾诉了诗人长年漂泊、老病孤愁的复杂感情，慷慨激越、动人心弦。
此诗前四句写登高见闻。首联对起。诗人围绕夔州的特定环境，用“风急”二字带动全联，一开头就写成了千古流传的佳句。夔州向以猿多著称，峡口更以风大闻名。秋日天高气爽，这里却猎猎多风。诗人登上高处，峡中不断传来“高猿长啸”之声，大有“空谷传响，哀转久绝”（《水经注·江水》）的意味。诗人移动视线，由高处转向江水洲渚，在水清沙白的背景上，点缀着迎风飞翔、不住回旋的鸟群，真是一幅精美的画图。其中天、风，沙、渚，猿啸、鸟飞，天造地设，自然成对。不仅上下两句对，而且还有句中自对，如上句“天”对“风”，“高”对“急”；下句“沙”对“渚”，“白”对“清”，读来富有节奏感。经过诗人的艺术提炼，十四个字，字字精当，无一虚设，用字遣辞，“尽谢斧凿”，达到了奇妙难名的境界。更值得注意的是：对起的首句，末字常用仄声，此诗却用平声入韵。沈德潜因有“起二句对举之中仍复用韵，格奇而变”（《唐诗别裁》）的赞语。颔联集中表现了夔州秋天的典型特征。诗人仰望茫无边际、萧萧而下的木叶，俯视奔流不息、滚滚而来的江水，在写景的同时，便深沉地抒发了自己的情怀。“无边”“不尽”，使“萧萧”“滚滚”更加形象化，不仅使人联想到落木窸窣之声，长江汹涌之状，也无形中传达出韶光易逝，壮志难酬的感怆。透过沉郁悲凉的对句，显示出神入化之笔力，确有“建瓴走坂”“百川东注”的磅礴气势。前人把它誉为“古今独步”的“句中化境”，是有道理的。
前两联极力描写秋景，直到颈联，才点出一个“秋”字。“独登台”，则表明诗人是在高处远眺，这就把眼前景和心中情紧密地联系在一起了。“常作客”，指出了诗人飘泊无定的生涯。“百年”，本喻有限的人生，此处专指暮年。“悲秋”两字写得沉痛。秋天不一定可悲，只是诗人目睹苍凉恢廓的秋景，不由想到自己沦落他乡、年老多病的处境，故生出无限悲愁之绪。诗人把久客最易悲愁，多病独爱登台的感情，概括进一联“雄阔高浑，实大声弘”的对句之中，使人深深地感到了他那沉重地跳动着的感情脉搏。此联的“万里”“百年”和上一联的“无边”“不尽”，还有相互呼应的作用：诗人的羁旅愁与孤独感，就像落叶和江水一样，推排不尽，驱赶不绝，情与景交融相洽。诗到此已给作客思乡的一般含意，添上久客孤独的内容，增入悲秋苦病的情思，加进离乡万里、人在暮年的感叹，诗意就更见深沉了。尾联对结，并分承五六两句。诗人备尝艰难潦倒之苦，国难家愁，使自己白发日多，再加上因病断酒，悲愁就更难排遣。本来兴会盎然地登高望远，此时却平白无故地惹恨添悲，诗人的矛盾心情是容易理解的。前六句“飞扬震动”，到此处“软冷收之，而无限悲凉之意，溢于言外”（胡应麟《诗薮》）。
此诗前半写景，后半抒情，在写法上各有错综之妙。首联着重刻画眼前具体景物，好比画家的工笔，形、声、色、态，一一得到表现。次联着重渲染整个秋天气氛，好比画家的写意，只宜传神会意，让读者用想象补充。三联表现感情，从纵（时间）、横（空间）两方面着笔，由异乡飘泊写到多病残生。四联又从白发日多，护病断饮，归结到时世艰难是潦倒不堪的根源。这样，杜甫忧国伤时的情操，便跃然纸上。
全诗八句皆对。粗略一看，首尾好像“未尝有对”，胸腹好像“无意于对”。仔细玩味，“一篇之中，句句皆律，一句之中，字字皆律”。不只“全篇可法”，而且“用句用字”，“皆古今人必不敢道，决不能道者”。因此它能博得“旷代之作”（均见《诗薮》）的盛誉。','⑴登高：农历九月九日为重阳节，历来有登高的习俗。
⑵猿啸哀：指长江三峡中猿猴凄厉的叫声。《水经注·江水》引民谣云：“巴东三峡巫峡长，猿鸣三声泪沾裳。”
⑶渚（zhǔ）：水中的小洲。沙：江边沙滩。鸟飞回：鸟在急风中飞舞盘旋。回，回旋。
⑷落木：指秋天飘落的树叶。萧萧：风吹落叶的声音。
⑸万里：指远离故乡。常作客：长期漂泊他乡。
⑹百年：犹言一生，这里借指晚年。
⑺艰难：兼指国运和自身命运。苦恨：极恨，极其遗憾。苦，极。繁霜鬓：增多了白发，如鬓边着霜雪。 繁，这里作动词，增多。
⑻潦倒：衰颓，失意。这里指衰老多病，志不得伸。新停：新近停止。重阳登高，例应喝酒。杜甫晚年因肺病戒酒，所以说“新停”。','风急天高猿啸哀  渚清沙白鸟飞回',2,1);

INSERT into poetry VALUES (NULL,4	,'己亥杂诗','<p>九州生气恃风雷，万马齐喑究可哀。</p>
<p>我劝天公重抖擞，不拘一格降人材。</p>',
'<p>只有依靠风雷激荡般的巨大力量才能使中国大地焕发勃勃生机，然而社会政局毫无生气终究是一种悲哀。</p>
<p>我奉劝上天要重新振作精神，不要拘泥一定规格以降下更多的人才。</p>','这是一首出色的政治诗。
　　全诗层次清晰，共分三个层次：第一层，写了万马齐喑，朝野噤声的死气沉沉的现实社会。“万马齐喑”，比喻在清朝统治下，人们不敢讲话，到处是一种令人窒息的沉闷气氛。这里用了一个典故。苏轼《三马图赞引》：“时（宋元祐初）西域贡马，首高八尺，龙颅而风骨，虎背而豹章，出东华门，入天驷监，振鬣长鸣，万马齐喑。”对于“万马齐喑”的局面，用一“哀”字，表明诗人痛惜之情与爱国之心。诗人于1810年到北京做官，满怀经世之志、治国之略，但是仕途的失意。政治主张的破灭，使他清醒地认识到他处在“平生进退两颠簸”（《十月廿夜大风不寐起而书怀》）的境遇中。
　　第二层，作者指出了要改变这种沉闷，腐朽的现状，就必须依靠风雷激荡般的巨大力量。暗喻必须经历波澜壮阔的社会变革才能使中国变得生机勃勃。
　　第三层，作者认为这样的力量来源于人材，而朝庭所应该做的就是破格荐用人材，只有这样，中国才有希望。“我劝天公重抖擞，不拘一格降人才。”运用移花接木的手法，表现了诗人渴望砸烂黑暗统治，出现一个崭新世界的愿望。“天公”，即玉皇，亦即世俗所谓老天爷。诗人揭露时弊，忽然就劝起老天爷来了，诗末自注云：“过镇江，见赛玉皇及风神、雷神者，祷祠数万，道士乞撰青词。”这个自注说明了诗人写这首诗的具体环境，看出了诗人是借“道士乞撰青词”之机，用民间迷信活动来为自己所要表达的思想感情服务。“不拘一格”，充分表现了诗人开阔的胸怀，远大的目光，具有战略性的设想。当时的清政府，腐朽无能，内忧外患，特别是帝国主义侵略者，虎视耽耽，奴役中国民族、灭亡中国国家之心不死，瓜分风潮，迫在眉睫，要拯救暴风中破船似的中国，非有各方面的大批人才，是无济于事的，所以诗人劝天公重新振作精神，不拘一格而降大批人才，共挽即倒的狂澜，将倾的大厦。“劝”字，颇具积极意义。它是奉劝，而不是乞求，表现了诗人处于踞离临下的地位，也显示出诗人变革的信心。
　　诗的前两句用了两个比喻，写出了诗人对当时中国形势的看法。“万马齐喑”比喻在腐朽、残酷的反动统治下，思想被禁锢，人才被扼杀，到处是昏沉、庸俗、愚昧，一片死寂、令人窒息的现实状况。“风雷”比喻新兴的社会力量，比喻尖锐猛烈的改革。从大处着眼、整体着眼、大气磅礴、雄浑深邃的艺术境界。诗的后两句，“我劝天公重抖擞，不拘一格降人才”是传诵的名句。诗人用奇特的想象表现了他热烈的希望，他期待着优秀杰出人物的涌现，期待着改革大势形成新的“风雷”、新的生机，一扫笼罩九州的沉闷和迟滞的局面，既揭露矛盾、批判现实，更憧憬未来、充满理想。它独辟奇境，别开生面，呼唤着变革，呼唤未来。','九州：中国的别称之一。分别是：冀州、兖州、青州、徐州、扬州、荆州、梁州、雍州和豫州。
生气：生气勃勃的局面。
恃（shì）：依靠。
万马齐喑：所有的马都沉寂无声。比喻社会政局毫无生气。
喑（yīn），沉默，不说话。
天公：造物主。
抖擞：振作，奋发。
降：降生，降临。','我劝天公重抖擞，不拘一格降人材',70,1);
